Revit 2018 API
DockablePanes.BuiltInDockablePanes Members
Provides a container of all Revit built-in DockablePaneId instances.
The DockablePanes.BuiltInDockablePanes type exposes the following members.
Properties
Name | Description
ElementView
 The element view pane.
FabricationPartBrowser
 The Fabrication part browser pane.
FamilyBrowser
 The family browser pane.
HostByLinkNavigator
 The host by link navigator pane.
ProjectBrowser
 The project browser pane.
PropertiesPalette
 The properties palette pane.
RebarBrowser
 The rebar browser pane.
SystemNavigator
 The system browser pane.
ViewBrowser
 The View browser pane.
See Also
DockablePanes.BuiltInDockablePanes Class
Autodesk.Revit.UI Namespace